Tekla Open API Reference for Tekla Structures 2025
PrinterItem Properties
The PrinterItem type exposes the following members.
Properties
Name | Description
Device
 The actual printer device used in the printing.
Extension
 The printer item's default file extension which is used when printing to a file.
Name
 The printer item's name which Tekla Structures uses to fetch all the item's default properties in the printing process.
PrintAreaHeigth
 The printer item's print area height.
PrintAreaWidth
 The printer item's print area width.
Top
See Also
Reference
PrinterItem Class
Tekla.Structures.Catalogs Namespace